### [DataFrame 인덱스 다루기]

-(1) 새로운 인덱스 설정 : 컬럼 ==> 인덱스 설정

1. 모듈 로딩 <hr>

In [39]:
import pandas as pd

2. 데이터 준비 <hr>

In [40]:
exam = { '이름':['손예림', '명노아', '변희진', '이윤서'], 
        '국어' : [98, 95, 96, 100],
        '미술' : [100,82,98,79], 
        '수학':[82,76,94,97], 
        '영어':[97,84,76,100] }

3. 데이터 저장<hr>

In [41]:
examDF=pd.DataFrame(exam)

4. 데이터 확인<hr>

In [42]:
examDF

    이름   국어   미술  수학   영어
0  손예림   98  100  82   97
1  명노아   95   82  76   84
2  변희진   96   98  94   76
3  이윤서  100   79  97  100

5. 새로운 인덱스 설정 - 방법(1): 인덱스 일부 변경 DF.rename() <hr>

In [43]:
# 행 인덱스 일부 변경 => {기존인덱스: 새로운인덱스}
# inplace 매개변수/파라미터 => 원본 DataFrame이 변경 여부 결정, 기본은 원본 변경 안함 False가 기본!!
examDF.rename(index={0:'zero'} , inplace=True)

In [44]:
examDF

       이름   국어   미술  수학   영어
zero  손예림   98  100  82   97
1     명노아   95   82  76   84
2     변희진   96   98  94   76
3     이윤서  100   79  97  100

In [45]:
# 열 이름 인덱스 일부 변경 => column={기존인덱스:새로운인덱스}
examDF.rename(columns={'영어':'음악'},inplace=True)

In [46]:
examDF

       이름   국어   미술  수학   음악
zero  손예림   98  100  82   97
1     명노아   95   82  76   84
2     변희진   96   98  94   76
3     이윤서  100   79  97  100

5. 새로운 인덱스 설정 - 방법(2): 특정 컬럼 => 인덱스 : DF.set_index()

In [47]:
# 현재 기본 0~ ==> 이름 컬럼 인덱스로 설정
examDF.index

Index(['zero', 1, 2, 3], dtype='object')

In [48]:
# 1개 컬럼을 인덱스로 설정 단, inplace 파라미터가 False로 원본 적용 안됨
examDF.set_index('이름')

      국어   미술  수학   음악
이름
손예림   98  100  82   97
명노아   95   82  76   84
변희진   96   98  94   76
이윤서  100   79  97  100

In [50]:
# 2개 컬럼을 인덱스로 설정 단, inplace 파라미터가 False로 원본 적용 안됨
examDF2=examDF.set_index(['이름', '국어'])
examDF2.index

MultiIndex([('손예림',  98),
            ('명노아',  95),
            ('변희진',  96),
            ('이윤서', 100)],
           names=['이름', '국어'])

In [51]:
examDF2.loc['이윤서']

     미술  수학   음악
국어
100  79  97  100

5. 새로운 인덱스 설정 - 방법(3): 특정 컬럼 => 인덱스 : DF.set_index()

In [56]:
examDF.set_index('이름',inplace=True)

In [57]:
examDF

      국어   미술  수학   음악
이름
손예림   98  100  82   97
명노아   95   82  76   84
변희진   96   98  94   76
이윤서  100   79  97  100

In [58]:
# 현재 행 인덱스 ==> 컬럼으로 추가
examDF.reset_index()

    이름   국어   미술  수학   음악
0  손예림   98  100  82   97
1  명노아   95   82  76   84
2  변희진   96   98  94   76
3  이윤서  100   79  97  100

In [60]:
# 현재 행 인덱스를 컬럼에 추가하지 않고 삭제 => drop 파라미터를 True로 설정
df2=examDF.reset_index(drop=True)
df2

    국어   미술  수학   음악
0   98  100  82   97
1   95   82  76   84
2   96   98  94   76
3  100   79  97  100